pellepl/baremetal/arch/msp/msp430/mdk/include/cc430f6125.h
#define DMA2TSEL_0             (0x0000)       /* DMA channel 2 transfer select 0:  DMA_REQ (sw) */
#define DMA2TSEL_1             (0x0001)       /* DMA channel 2 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA2TSEL_2             (0x0002)       /* DMA channel 2 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA2TSEL_3             (0x0003)       /* DMA channel 2 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA2TSEL_4             (0x0004)       /* DMA channel 2 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA2TSEL_5             (0x0005)       /* DMA channel 2 transfer select 5:  TimerB (TB0CCR0.IFG) */
#define DMA2TSEL_6             (0x0006)       /* DMA channel 2 transfer select 6:  TimerB (TB0CCR2.IFG) */
#define DMA2TSEL_7             (0x0007)       /* DMA channel 2 transfer select 7:  Reserved */
#define DMA2TSEL_8             (0x0008)       /* DMA channel 2 transfer select 8:  Reserved */
#define DMA2TSEL_9             (0x0009)       /* DMA channel 2 transfer select 9:  Reserved */
#define DMA2TSEL_10            (0x000A)       /* DMA channel 2 transfer select 10: Reserved */
#define DMA2TSEL_11            (0x000B)       /* DMA channel 2 transfer select 11: Reserved */
#define DMA2TSEL_12            (0x000C)       /* DMA channel 2 transfer select 12: Reserved */
#define DMA2TSEL_13            (0x000D)       /* DMA channel 2 transfer select 13: Reserved */
#define DMA2TSEL_14            (0x000E)       /* DMA channel 2 transfer select 14: RFRXIFG */
#define DMA2TSEL_15            (0x000F)       /* DMA channel 2 transfer select 15: RFTXIFG */
#define DMA2TSEL_16            (0x0010)       /* DMA channel 2 transfer select 16: USCIA0 receive */
#define DMA2TSEL_17            (0x0011)       /* DMA channel 2 transfer select 17: USCIA0 transmit */
#define DMA2TSEL_18            (0x0012)       /* DMA channel 2 transfer select 18: USCIB0 receive */
#define DMA2TSEL_19            (0x0013)       /* DMA channel 2 transfer select 19: USCIB0 transmit */
#define DMA2TSEL_20            (0x0014)       /* DMA channel 2 transfer select 20: Reserved  */
#define DMA2TSEL_21            (0x0015)       /* DMA channel 2 transfer select 21: Reserved  */
#define DMA2TSEL_22            (0x0016)       /* DMA channel 2 transfer select 22: Reserved  */
#define DMA2TSEL_23            (0x0017)       /* DMA channel 2 transfer select 23: Reserved  */
#define DMA2TSEL_24            (0x0018)       /* DMA channel 2 transfer select 24: Reserved */
#define DMA2TSEL_25            (0x0019)       /* DMA channel 2 transfer select 25: Reserved */
#define DMA2TSEL_26            (0x001A)       /* DMA channel 2 transfer select 26: Reserved */
#define DMA2TSEL_27            (0x001B)       /* DMA channel 2 transfer select 27: Reserved */
#define DMA2TSEL_28            (0x001C)       /* DMA channel 2 transfer select 28: Reserved */
#define DMA2TSEL_29            (0x001D)       /* DMA channel 2 transfer select 29: Multiplier ready */
#define DMA2TSEL_30            (0x001E)       /* DMA channel 2 transfer select 30: previous DMA channel DMA1IFG */
#define DMA2TSEL_31            (0x001F)       /* DMA channel 2 transfer select 31: ext. Trigger (DMAE0) */

#define DMA0TSEL__DMA_REQ      (0x0000)       /* DMA channel 0 transfer select 0:  DMA_REQ (sw) */
#define DMA0TSEL__TA0CCR0      (0x0001)       /* DMA channel 0 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA0TSEL__TA0CCR2      (0x0002)       /* DMA channel 0 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA0TSEL__TA1CCR0      (0x0003)       /* DMA channel 0 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA0TSEL__TA1CCR2      (0x0004)       /* DMA channel 0 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA0TSEL__TB0CCR0      (0x0005)       /* DMA channel 0 transfer select 5:  TimerB (TB0CCR0.IFG) */
#define DMA0TSEL__TB0CCR2      (0x0006)       /* DMA channel 0 transfer select 6:  TimerB (TB0CCR2.IFG) */
#define DMA0TSEL__RES7         (0x0007)       /* DMA channel 0 transfer select 7:  Reserved */
#define DMA0TSEL__RES8         (0x0008)       /* DMA channel 0 transfer select 8:  Reserved */
#define DMA0TSEL__RES9         (0x0009)       /* DMA channel 0 transfer select 9:  Reserved */
#define DMA0TSEL__RES10        (0x000A)       /* DMA channel 0 transfer select 10: Reserved */
#define DMA0TSEL__RES11        (0x000B)       /* DMA channel 0 transfer select 11: Reserved */
#define DMA0TSEL__RES12        (0x000C)       /* DMA channel 0 transfer select 12: Reserved */
#define DMA0TSEL__RES13        (0x000D)       /* DMA channel 0 transfer select 13: Reserved */
#define DMA0TSEL__RFRXIFG      (0x000E)       /* DMA channel 0 transfer select 14: RFRXIFG */
#define DMA0TSEL__RFTXIFG      (0x000F)       /* DMA channel 0 transfer select 15: RFTXIFG */
#define DMA0TSEL__USCIA0RX     (0x0010)       /* DMA channel 0 transfer select 16: USCIA0 receive */
#define DMA0TSEL__USCIA0TX     (0x0011)       /* DMA channel 0 transfer select 17: USCIA0 transmit */
#define DMA0TSEL__USCIB0RX     (0x0012)       /* DMA channel 0 transfer select 18: USCIB0 receive */
#define DMA0TSEL__USCIB0TX     (0x0013)       /* DMA channel 0 transfer select 19: USCIB0 transmit */
#define DMA0TSEL__RES20        (0x0014)       /* DMA channel 0 transfer select 20: Reserved  */
#define DMA0TSEL__RES21        (0x0015)       /* DMA channel 0 transfer select 21: Reserved  */
#define DMA0TSEL__RES22        (0x0016)       /* DMA channel 0 transfer select 22: Reserved  */
#define DMA0TSEL__RES23        (0x0017)       /* DMA channel 0 transfer select 23: Reserved  */
#define DMA0TSEL__RES24        (0x0018)       /* DMA channel 0 transfer select 24: Reserved */
#define DMA0TSEL__RES25        (0x0019)       /* DMA channel 0 transfer select 25: Reserved */
#define DMA0TSEL__RES26        (0x001A)       /* DMA channel 0 transfer select 26: Reserved */
#define DMA0TSEL__RES27        (0x001B)       /* DMA channel 0 transfer select 27: Reserved */
#define DMA0TSEL__RES28        (0x001C)       /* DMA channel 0 transfer select 28: Reserved */
#define DMA0TSEL__MPY          (0x001D)       /* DMA channel 0 transfer select 29: Multiplier ready */
#define DMA0TSEL__DMA2IFG      (0x001E)       /* DMA channel 0 transfer select 30: previous DMA channel DMA2IFG */
#define DMA0TSEL__DMAE0        (0x001F)       /* DMA channel 0 transfer select 31: ext. Trigger (DMAE0) */

